diploma thesis/src/design/assets/setCredentials-request.xml

<soapenv:Envelope
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:core="http://core.bootware.simtech.org/">
	<soapenv:Header/>
	<soapenv:Body>
		<core:setCredentials>
			<arg0>
				<credentials>
					<credential for="aws">
						<secretKey>8d2cdbd7f909a7989352d085978915c1</secretKey>
						<accessKey>d589033fe6479a</accessKey>
					</credential>
				</credentials>
			</arg0>
		</core:setCredentials>
	</soapenv:Body>
</soapenv:Envelope>
